## Plan Result (prod_apim_appgw)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw"
        name                              = "cft-apim00-prod-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = [
              + "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "cft-mtls-api-mgmt-appgw-address-pool"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-commissioning-http-settings" -> null
          - name                                = "civil-sdt-commissioning-http-settings" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-commissioning-probe" -> null
          - probe_name                          = "civil-sdt-commissioning-probe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (2 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-http-settings" -> null
          - name                                = "civil-sdt-http-settings" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-probe" -> null
          - probe_name                          = "civil-sdt-probe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (2 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-test-http-settings" -> null
          - name                                = "civil-sdt-test-http-settings" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-test-probe" -> null
          - probe_name                          = "civil-sdt-test-probe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (2 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "cft-mtls-api-mgmt-appgw-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "cft-mtls-api-mgmt-appgw-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-commissioning-http-settings"
          + name                                = "civil-sdt-commissioning-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-commissioning-probe"
          + probe_name                          = "civil-sdt-commissioning-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-http-settings"
          + name                                = "civil-sdt-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-probe"
          + probe_name                          = "civil-sdt-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-test-http-settings"
          + name                                = "civil-sdt-test-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-test-probe"
          + probe_name                          = "civil-sdt-test-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "commissioning.sdt.justice.gov.uk" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt-commissioning" -> null
          - name                           = "civil-sdt-commissioning" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/civil-sdt-commissioning-prod" -> null
          - ssl_certificate_name           = "civil-sdt-commissioning-prod" -> null
          - ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-commissioning-sslprofile" -> null
          - ssl_profile_name               = "civil-sdt-commissioning-sslprofile" -> null
            # (1 unchanged attribute hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "sdt.justice.gov.uk" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt" -> null
          - name                           = "civil-sdt" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/civil-sdt-prod" -> null
          - ssl_certificate_name           = "civil-sdt-prod" -> null
          - ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-sslprofile" -> null
          - ssl_profile_name               = "civil-sdt-sslprofile" -> null
            # (1 unchanged attribute hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "testdt.justice.gov.uk" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt-test" -> null
          - name                           = "civil-sdt-test" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/civil-sdt-commissioning-prod" -> null
          - ssl_certificate_name           = "civil-sdt-commissioning-prod" -> null
          - ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-test-sslprofile" -> null
          - ssl_profile_name               = "civil-sdt-test-sslprofile" -> null
            # (1 unchanged attribute hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "cft-mtls-api-mgmt-appgw"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "cft-mtls-api-mgmt-appgw-sslprofile"
            # (1 unchanged attribute hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp"
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https"
          + frontend_port_name             = "https"
          + host_name                      = "commissioning.sdt.justice.gov.uk"
          + host_names                     = []
          + id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt-commissioning"
          + name                           = "civil-sdt-commissioning"
          + protocol                       = "Https"
          + ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/civil-sdt-commissioning-prod"
          + ssl_certificate_name           = "civil-sdt-commissioning-prod"
          + ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-commissioning-sslprofile"
          + ssl_profile_name               = "civil-sdt-commissioning-sslprofile"
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp"
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https"
          + frontend_port_name             = "https"
          + host_name                      = "sdt.justice.gov.uk"
          + host_names                     = []
          + id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt"
          + name                           = "civil-sdt"
          + protocol                       = "Https"
          + ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/civil-sdt-prod"
          + ssl_certificate_name           = "civil-sdt-prod"
          + ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-sslprofile"
          + ssl_profile_name               = "civil-sdt-sslprofile"
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp"
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https"
          + frontend_port_name             = "https"
          + host_name                      = "testdt.justice.gov.uk"
          + host_names                     = []
          + id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt-test"
          + name                           = "civil-sdt-test"
          + protocol                       = "Https"
          + ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/civil-sdt-commissioning-prod"
          + ssl_certificate_name           = "civil-sdt-commissioning-prod"
          + ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-test-sslprofile"
          + ssl_profile_name               = "civil-sdt-test-sslprofile"
        }

      - probe {
          - host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-commissioning-probe" -> null
          - interval                                  = 10 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "civil-sdt-commissioning-probe" -> null
          - path                                      = "/status-0123456789abcdef" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-probe" -> null
          - interval                                  = 10 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "civil-sdt-probe" -> null
          - path                                      = "/status-0123456789abcdef" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-test-probe" -> null
          - interval                                  = 10 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "civil-sdt-test-probe" -> null
          - path                                      = "/status-0123456789abcdef" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "cft-mtls-api-mgmt-appgw-probe"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "civil-sdt-commissioning-probe"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "civil-sdt-probe"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "civil-sdt-test-probe"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/civil-sdt-address-pool" -> null
          - backend_address_pool_name   = "civil-sdt-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-http-settings" -> null
          - backend_http_settings_name  = "civil-sdt-http-settings" -> null
          - http_listener_id            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt" -> null
          - http_listener_name          = "civil-sdt" -> null
          - id                          = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/requestRoutingRules/civil-sdt" -> null
          - name                        = "civil-sdt" -> null
          - priority                    = 20 -> null
          - rewrite_rule_set_id         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-rewriterule" -> null
          - rewrite_rule_set_name       = "civil-sdt-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/civil-sdt-commissioning-address-pool" -> null
          - backend_address_pool_name   = "civil-sdt-commissioning-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-commissioning-http-settings" -> null
          - backend_http_settings_name  = "civil-sdt-commissioning-http-settings" -> null
          - http_listener_id            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt-commissioning" -> null
          - http_listener_name          = "civil-sdt-commissioning" -> null
          - id                          = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/requestRoutingRules/civil-sdt-commissioning" -> null
          - name                        = "civil-sdt-commissioning" -> null
          - priority                    = 10 -> null
          - rewrite_rule_set_id         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-commissioning-rewriterule" -> null
          - rewrite_rule_set_name       = "civil-sdt-commissioning-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/civil-sdt-test-address-pool" -> null
          - backend_address_pool_name   = "civil-sdt-test-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-test-http-settings" -> null
          - backend_http_settings_name  = "civil-sdt-test-http-settings" -> null
          - http_listener_id            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt-test" -> null
          - http_listener_name          = "civil-sdt-test" -> null
          - id                          = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/requestRoutingRules/civil-sdt-test" -> null
          - name                        = "civil-sdt-test" -> null
          - priority                    = 30 -> null
          - rewrite_rule_set_id         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-test-rewriterule" -> null
          - rewrite_rule_set_name       = "civil-sdt-test-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "cft-mtls-api-mgmt-appgw-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "cft-mtls-api-mgmt-appgw-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "cft-mtls-api-mgmt-appgw"
          + id                          = (known after apply)
          + name                        = "cft-mtls-api-mgmt-appgw"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "cft-mtls-api-mgmt-appgw-rewriterule"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "civil-sdt-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "civil-sdt-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "civil-sdt"
          + id                          = (known after apply)
          + name                        = "civil-sdt"
          + priority                    = 30
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "civil-sdt-rewriterule"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "civil-sdt-commissioning-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "civil-sdt-commissioning-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "civil-sdt-commissioning"
          + id                          = (known after apply)
          + name                        = "civil-sdt-commissioning"
          + priority                    = 20
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "civil-sdt-commissioning-rewriterule"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "civil-sdt-test-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "civil-sdt-test-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "civil-sdt-test"
          + id                          = (known after apply)
          + name                        = "civil-sdt-test"
          + priority                    = 40
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "civil-sdt-test-rewriterule"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ rewrite_rule_set {
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-commissioning-rewriterule"
          ~ name = "civil-sdt-commissioning-rewriterule" -> "cft-mtls-api-mgmt-appgw-rewriterule"

          ~ rewrite_rule {
              ~ name          = "SdtAddCustomHeadersRule" -> "AddCustomHeadersRule"
                # (1 unchanged attribute hidden)

              ~ request_header_configuration {
                  ~ header_name  = "CLIENT-IP-AGW" -> "X-ARR-ClientCertThumbprint"
                  ~ header_value = "{var_client_ip}" -> "{var_client_certificate_fingerprint}"
                }
              - request_header_configuration {
                  - header_name  = "X-ARR-ClientCertSub-AGW" -> null
                  - header_value = "{var_client_certificate_subject}" -> null
                }
              - request_header_configuration {
                  - header_name  = "URI-PATH-AGW" -> null
                  - header_value = "{var_uri_path}" -> null
                }
            }
          - rewrite_rule {
              - name          = "SdtUrlRewriteRule" -> null
              - rule_sequence = 200 -> null

              - condition {
                  - ignore_case = false -> null
                  - negate      = false -> null
                  - pattern     = ".*/producers(?>-comx)?/service/sdtapi" -> null
                  - variable    = "var_uri_path" -> null
                }

              - url {
                  - components   = "path_only" -> null
                  - path         = "/sdt-gateway" -> null
                  - reroute      = false -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-rewriterule"
          ~ name = "civil-sdt-rewriterule" -> "civil-sdt-commissioning-rewriterule"

            # (2 unchanged blocks hidden)
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-test-rewriterule"
          ~ name = "civil-sdt-test-rewriterule" -> "civil-sdt-rewriterule"

            # (2 unchanged blocks hidden)
        }
      + rewrite_rule_set {
          + name = "civil-sdt-test-rewriterule"

          + rewrite_rule {
              + name          = "SdtAddCustomHeadersRule"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "CLIENT-IP-AGW"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-ARR-ClientCertSub-AGW"
                  + header_value = "{var_client_certificate_subject}"
                }
              + request_header_configuration {
                  + header_name  = "URI-PATH-AGW"
                  + header_value = "{var_uri_path}"
                }
            }
          + rewrite_rule {
              + name          = "SdtUrlRewriteRule"
              + rule_sequence = 200

              + condition {
                  + ignore_case = false
                  + negate      = false
                  + pattern     = ".*/producers(?>-comx)?/service/sdtapi"
                  + variable    = "var_uri_path"
                }

              + url {
                  + components = "path_only"
                  + path       = "/sdt-gateway"
                  + reroute    = false
                }
            }
        }

      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ ssl_profile {
            id                                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-commissioning-sslprofile"
          ~ name                                 = "civil-sdt-commissioning-sslprofile" -> "cft-mtls-api-mgmt-appgw-sslprofile"
          ~ trusted_client_certificate_names     = [
              ~ "civil-sdt-commissioning-civil_sdt_root_ca" -> "cft-mtls-api-mgmt-appgw-liberata_ca",
            ]
            # (2 unchanged attributes hidden)
        }
      ~ ssl_profile {
            id                                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-sslprofile"
          ~ name                                 = "civil-sdt-sslprofile" -> "civil-sdt-commissioning-sslprofile"
          ~ trusted_client_certificate_names     = [
              ~ "civil-sdt-civil_sdt_root_ca" -> "civil-sdt-commissioning-civil_sdt_root_ca",
            ]
            # (2 unchanged attributes hidden)
        }
      ~ ssl_profile {
            id                                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-test-sslprofile"
          ~ name                                 = "civil-sdt-test-sslprofile" -> "civil-sdt-sslprofile"
          ~ trusted_client_certificate_names     = [
              ~ "civil-sdt-test-civil_sdt_root_ca" -> "civil-sdt-civil_sdt_root_ca",
            ]
            # (2 unchanged attributes hidden)
        }
      + ssl_profile {
          + name                             = "civil-sdt-test-sslprofile"
          + trusted_client_certificate_names = [
              + "civil-sdt-test-civil_sdt_root_ca",
            ]
          + verify_client_cert_issuer_dn     = true
        }

      ~ trusted_client_certificate {
          ~ data = (sensitive value)
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/civil-sdt-commissioning-civil_sdt_root_ca"
          ~ name = "civil-sdt-commissioning-civil_sdt_root_ca" -> "cft-mtls-api-mgmt-appgw-liberata_ca"
        }
      ~ trusted_client_certificate {
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/civil-sdt-civil_sdt_root_ca"
          ~ name = "civil-sdt-civil_sdt_root_ca" -> "civil-sdt-commissioning-civil_sdt_root_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/civil-sdt-test-civil_sdt_root_ca"
          ~ name = "civil-sdt-test-civil_sdt_root_ca" -> "civil-sdt-civil_sdt_root_ca"
            # (1 unchanged attribute hidden)
        }
      + trusted_client_certificate {
          + data = (sensitive value)
          + name = "civil-sdt-test-civil_sdt_root_ca"
        }

        # (13 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw|AppGw"
        name                           = "AppGw"
        # (5 unchanged attributes hidden)

      ~ metric {
          + eventhub_authorization_rule_id = (known after apply)
          + eventhub_name                  = (known after apply)
          + id                             = (known after apply)
          + log_analytics_destination_type = (known after apply)
          + log_analytics_workspace_id     = (known after apply)
          + name                           = (known after apply)
          + partner_solution_id            = (known after apply)
          + storage_account_id             = (known after apply)
          + target_resource_id             = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2234,"Program":"tfcmt","SHA1":"","Target":"prod_apim_appgw","Vars":{}} -->